ELPasEDT/src/InformationRegisters/КонтрольВводаДанных/КонтрольВводаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтрольВводаДанных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Заполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разделитель1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/ЗначенияРеквизитовПаспортов/ЗначенияРеквизитовПаспортов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияРеквизитовПаспортов</name>
  <comment>(ИТ-Плюс)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.РеквизитыПаспортовОборудования</types>
    </type>
  </resources>
  <resources>
    <name>НетДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.РеквизитыПаспортовОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/ОборудованиеОтветственныеЛица/ОборудованиеОтветственныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборудованиеОтветственныеЛица</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Catalogs/ВидыОборудования/ВидыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОборудования</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>КодSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаДляИзменения</name>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <comment>Категория вида оборудования</comment>
    <type>
      <types>CatalogRef.КатегорииВидовОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыДляВидаОборудования</name>
    <attributes>
      <name>Уникален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоДопРеквизит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязателенДляЗаполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтборПриВыборе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображатьПриСоздании</name>
      <comment>Истина - реквизит отображается в форме помощника ввода нового элемента номенклатуры, Ложь - не отображается</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступностьУникален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступностьОбязателенДляЗаполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступностьОтображатьПриСоздании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитыПаспорта</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>CatalogRef.ГруппыКолонокПаспорта</types>
        <types>ChartOfCharacteristicTypesRef.РеквизитыПаспортовОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиОценкиСостоянияОборудования</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПоказателиОценкиСостоянияОборудования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КритерииОценкиСостоянияОборудования</name>
    <attributes>
      <name>ОценкаСостояния</name>
      <type>
        <types>EnumRef.ОценкиСостоянияОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммарныйВесовойКэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/Catalogs/ГруппыКолонокПаспорта/ГруппыКолонокПаспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыКолонокПаспорта</name>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыГруппы</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыПаспортовОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/CommonModules/КонтрольВводаДанных/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// API

Процедура ПриСозданииФормы(Форма, Отказ, СтандартнаяОбработка) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	СостояниеЗаполнения = ПолучитьСостояниеЗаполненияОборудования(Форма.Объект.Ссылка, Форма.Объект.ВидОборудования);
	ОбновитьИндикациюВФорме(Форма, СостояниеЗаполнения);
	
КонецПроцедуры

Процедура ПослеЗаписиВФорме(Форма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Форма.Объект.ВидОборудования) Тогда
		СостояниеЗаполнения = ОбновитьСостояниеЗаполнения(Форма.Объект.Ссылка, Форма.Объект.ВидОборудования);
		ОбновитьИндикациюВФорме(Форма, СостояниеЗаполнения);
	Иначе
		ОчиститьРегистрКонтроляВводаДанных(Форма.Объект.Ссылка)
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбновитьИндикациюВФорме(Форма, СостояниеЗаполнения)
	
	Если СостояниеЗаполнения.Реквизиты Тогда
		Форма.Элементы.ГруппаОсновные.Картинка = БиблиотекаКартинок.Успешно
	Иначе
		Форма.Элементы.ГруппаОсновные.Картинка = БиблиотекаКартинок.ФорматПустой
	КонецЕсли;
	
	Если СостояниеЗаполнения.Паспорт Тогда
		Форма.Элементы.ГруппаПаспортОборудования.Картинка = БиблиотекаКартинок.Успешно
	Иначе
		Форма.Элементы.ГруппаПаспортОборудования.Картинка = БиблиотекаКартинок.ФорматПустой
	КонецЕсли;
	
	Если СостояниеЗаполнения.Ответственный Тогда
		Форма.Элементы.ГруппаОтветственныеЛица.Картинка = БиблиотекаКартинок.Успешно
	Иначе
		Форма.Элементы.ГруппаОтветственныеЛица.Картинка = БиблиотекаКартинок.ФорматПустой
	КонецЕсли;
	
КонецПроцедуры

Функция ОбновитьСостояниеЗаполнения(Ссылка, ВидОборудования, Период = '00010101') Экспорт
	
	СостояниеЗаполнения = ПолучитьСостояниеЗаполненияОборудования(Ссылка, ВидОборудования);
	
	Заполнено = Истина;
	
	Для Каждого Элемент Из СостояниеЗаполнения Цикл
		
		ТекСостояние = ТекущееСостояниеЗаполненияОборудования(Ссылка, Элемент.Ключ, Период);
		
		Если ТекСостояние <> Элемент.Значение Тогда
		
			МенеджерЗаписи = РегистрыСведений.КонтрольВводаДанных.СоздатьМенеджерЗаписи();
			Если ЗначениеЗаполнено(Период) Тогда
				МенеджерЗаписи.Период = Период;
			Иначе
				МенеджерЗаписи.Период = ТекущаяДатаСеанса();
			КонецЕсли;
			МенеджерЗаписи.Объект = Ссылка;
			МенеджерЗаписи.Разделитель1 = Элемент.Ключ;
			МенеджерЗаписи.Заполнен = Элемент.Значение;
			
			Если Не МенеджерЗаписи.Заполнен Тогда
				Заполнено =Ложь;
			КонецЕсли;
			
			МенеджерЗаписи.Записать();
			
		ИначеЕсли ТекСостояние = Ложь Тогда	
			Заполнено =Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекСостояние = ТекущееСостояниеЗаполненияОборудования(Ссылка,, Период);
	
	Если ТекСостояние <> Заполнено Тогда
		МенеджерЗаписи = РегистрыСведений.КонтрольВводаДанных.СоздатьМенеджерЗаписи();
		Если ЗначениеЗаполнено(Период) Тогда
			МенеджерЗаписи.Период = Период;
		Иначе
			МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		КонецЕсли;
		МенеджерЗаписи.Объект = Ссылка;
		МенеджерЗаписи.Разделитель1 = "";
		МенеджерЗаписи.Заполнен = Заполнено;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
	Возврат СостояниеЗаполнения;
	
КонецФункции

Функция ТекущееСостояниеЗаполненияОборудования(Объект, Разделитель = "", Период = '00010101')
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КонтрольВводаДанныхСрезПоследних.Заполнен КАК Заполнен
	|ИЗ
	|	РегистрСведений.КонтрольВводаДанных.СрезПоследних(
	|			&Период,
	|			Объект = &Объект
	|				И Разделитель1 = &Разделитель1) КАК КонтрольВводаДанныхСрезПоследних");
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Разделитель1", Разделитель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Заполнен;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОчиститьРегистрКонтроляВводаДанных(СсылкаНаОбъект)
	
	НаборЗаписей = РегистрыСведений.КонтрольВводаДанных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(СсылкаНаОбъект, Истина);
	НаборЗаписей.Записать();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБОРУДОВАНИЕ

Функция ПолучитьСостояниеЗаполненияОборудования(Ссылка, ВидОборудования)
	
	ПараметрыКонтроля = Новый Структура;
	
	///////////////////////////////////////////////////////////////////////////////
	// Заполнение реквизитов справочника
	ПараметрыКонтроля.Вставить("Реквизиты", Истина);
	ИменаПроверяемыхРеквизитов = Новый Массив;
	ИменаПроверяемыхРеквизитов.Добавить("ДиспетчерскоеНаименование");
	ИменаПроверяемыхРеквизитов.Добавить("ДатаВводаВЭксплуатацию");
	ИменаПроверяемыхРеквизитов.Добавить("Марка");
	ИменаПроверяемыхРеквизитов.Добавить("ЗаводИзготовитель");
	ИменаПроверяемыхРеквизитов.Добавить("Подразделение");
	Для Каждого Имя Из ИменаПроверяемыхРеквизитов Цикл
		Если Не  ЗначениеЗаполнено(Ссылка[Имя]) Тогда
			ПараметрыКонтроля.Реквизиты = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	///////////////////////////////////////////////////////////////////////////////
	// Заполнение паспорта
	ПараметрыКонтроля.Вставить("Паспорт", Ложь);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВидыОборудованияРеквизитыПаспорта.Реквизит ССЫЛКА ПланВидовХарактеристик.РеквизитыПаспортовОборудования
	|			ТОГДА ВидыОборудованияРеквизитыПаспорта.Реквизит
	|		ИНАЧЕ ГруппыКолонокПаспортаРеквизитыГруппы.Реквизит
	|	КОНЕЦ КАК Реквизит
	|ПОМЕСТИТЬ ВТ_РеквизитыПаспорта
	|ИЗ
	|	Справочник.ВидыОборудования.РеквизитыПаспорта КАК ВидыОборудованияРеквизитыПаспорта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыКолонокПаспорта.РеквизитыГруппы КАК ГруппыКолонокПаспортаРеквизитыГруппы
	|		ПО ВидыОборудованияРеквизитыПаспорта.Реквизит = ГруппыКолонокПаспортаРеквизитыГруппы.Ссылка
	|ГДЕ
	|	ВидыОборудованияРеквизитыПаспорта.Ссылка = &ВидОборудования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияРеквизитовПаспортов.Период КАК Период,
	|	ВТ_РеквизитыПаспорта.Реквизит КАК Реквизит,
	|	ЕСТЬNULL(ЗначенияРеквизитовПаспортов.Значение, """") КАК Значение,
	|	0 КАК Заполнено,
	|	1 КАК Количество
	|ИЗ
	|	ВТ_РеквизитыПаспорта КАК ВТ_РеквизитыПаспорта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияРеквизитовПаспортов КАК ЗначенияРеквизитовПаспортов
	|		ПО ВТ_РеквизитыПаспорта.Реквизит = ЗначенияРеквизитовПаспортов.Реквизит
	|ГДЕ
	|	ЗначенияРеквизитовПаспортов.Объект = &Объект
	|	И ВЫБОР
	|			КОГДА ЗначенияРеквизитовПаспортов.НетДанных ЕСТЬ НЕ NULL 
	|				ТОГДА НЕ ЗначенияРеквизитовПаспортов.НетДанных
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.УстановитьПараметр("ВидОборудования", ВидОборудования);
	Паспорт = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из Паспорт Цикл
		Если ТипЗнч(Стр.Значение) = Тип("Строка") Тогда
			Стр.Заполнено = Число(Не ПустаяСтрока(Стр.Значение));
		Иначе
			Стр.Заполнено = Число(ЗначениеЗаполнено(Стр.Значение));
		КонецЕсли;
	КонецЦикла;
	
	Паспорт.Свернуть("Период", "Заполнено, Количество");
	Паспорт.Сортировать("Заполнено");
	Если Паспорт.Количество() > 0 Тогда
		ПараметрыКонтроля.Паспорт = 
			(?(Паспорт[0].Количество <> 0, Паспорт[0].Заполнено / Паспорт[0].Количество, 0)) >= 0.4;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////
	// Заполнение ответственных
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.ОборудованиеОтветственныеЛица КАК ОборудованиеОтветственныеЛица
	|ГДЕ
	|	ОборудованиеОтветственныеЛица.Оборудование = &Объект";
	Результат = Запрос.Выполнить();
	ПараметрыКонтроля.Вставить("Ответственный", Не Результат.Пустой());
	
	Возврат ПараметрыКонтроля;
	
КонецФункции
